{
    "class_name": "Sequential",
    "config": {
        "name": "sequential",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "embedding_input"
                }
            },
            {
                "class_name": "Embedding",
                "config": {
                    "name": "embedding",
                    "trainable": true,
                    "dtype": "float32",
                    "input_dim": 9452,
                    "output_dim": 50,
                    "embeddings_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "minval": -0.05,
                            "maxval": 0.05,
                            "seed": null
                        }
                    },
                    "embeddings_regularizer": null,
                    "activity_regularizer": null,
                    "embeddings_constraint": null,
                    "mask_zero": false,
                    "input_length": 50
                }
            },
            {
                "class_name": "Bidirectional",
                "config": {
                    "name": "bidirectional",
                    "trainable": true,
                    "dtype": "float32",
                    "layer": {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": true,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "units": 100,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.1,
                            "implementation": 1
                        }
                    },
                    "merge_mode": "concat"
                }
            },
            {
                "class_name": "TimeDistributed",
                "config": {
                    "name": "time_distributed",
                    "trainable": true,
                    "dtype": "float32",
                    "layer": {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 10,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                }
            }
        ]
    }
}
